In [1]:
%load_ext sql
%sql sqlite:///love4pets.db

In [2]:
%sql select * from departamento;

 * sqlite:///love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'veterinario'),
 (6, 'informatica'),
 (7, 'investigacion')]

In [3]:
%sql select * from departamento

 * sqlite:///love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'veterinario'),
 (6, 'informatica'),
 (7, 'investigacion')]

In [4]:
%sql select * from empleado

 * sqlite:///love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (2, 'Lucas Serrano Caballero', 'lucas99@gmail.com', '115-24-36', 1200, '2018-05-17 00:00:000', 2),
 (3, 'Pablo Pons Sanz', 'ppsanz@gmail.com', '748-72-75', 1350, '2016-07-01 00:00:000', 1),
 (4, 'Saul Moreno Santos', 'saul.morenosantos@gmail.com', '346-87-27', 1600, '2016-07-01 00:00:000', 1),
 (5, 'Nil Soler Diez', 'nilsoler@gmail.com', '576-84-28', 1100, '2016-04-03 00:00:000', 5),
 (6, 'Sergio Reyes Gallardo', 'zerg@gmail.com', '598-95-67', 1000, '2016-04-03 00:00:000', 5),
 (7, 'Isaac Jimenez Ortiz', 'isaacortiz@gmail.com', '370-19-65', 1600, '2016-07-08 00:00:000', 3),
 (8, 'Guillermo Vidal Gomez', 'guillevidal@gmail.com', '099-05-68', 1400, '2016-01-03 00:00:000', 3),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (10, 'Juan Manuel Olivares', 'juanma@gmail.com', '269-37-06', 1500, '2017-03-05 00:00:000', None),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]


Ejercicio 1.

Complete el siguiente código para obtener un listado de los nombres, telefonos y ciudad de todos los clientes.

In [5]:
%sql PRAGMA table_info(cliente)

 * sqlite:///love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

In [6]:
%sql select nombre, telefono, ciudad from cliente

 * sqlite:///love4pets.db
Done.

[('Mario Flores Gallardo', '036-15-36', 'Madrid'),
 ('Arnau Medina Garcia', '094-10-88', 'Madrid'),
 ('Ivan Medina Rubio', '083-08-72', 'Toledo'),
 ('Jan Vargas Santana', '780-65-24', 'Madrid'),
 ('Carlos Costa Guerrero', '180-65-24', 'Madrid'),
 ('Roberto Martin Ortega', '742-63-27', 'Madrid'),
 ('Gabriel Gonzalez Ortega', '780-13-14', 'Madrid'),
 ('Rayan Leon Ferrer', '430-65-24', 'Madrid'),
 ('Aitor Ruiz Sanchez', '780-77-24', 'Madrid'),
 ('Eric Rubio Carrasco', '780-65-79', 'Madrid'),
 ('Alberto Sanz Ruiz', '781-15-24', 'Madrid'),
 ('Jesus Medina Hernandez', '782-35-25', 'Madrid'),
 ('Pol Moya Pena', '780-25-24', 'Toledo'),
 ('Jose Gallardo Rodriguez', '783-65-11', 'Madrid'),
 ('Manuel Angel Gil', '733-65-16', 'Madrid')]

In [7]:
%sql select nombre, telefono, ciudad from cliente orderby nombre

 * sqlite:///love4pets.db
(sqlite3.OperationalError) near "nombre": syntax error
[SQL: select nombre, telefono, ciudad from cliente orderby nombre]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [8]:
%sql select nombre, telefono, ciudad from cliente order by nombre

 * sqlite:///love4pets.db
Done.

[('Aitor Ruiz Sanchez', '780-77-24', 'Madrid'),
 ('Alberto Sanz Ruiz', '781-15-24', 'Madrid'),
 ('Arnau Medina Garcia', '094-10-88', 'Madrid'),
 ('Carlos Costa Guerrero', '180-65-24', 'Madrid'),
 ('Eric Rubio Carrasco', '780-65-79', 'Madrid'),
 ('Gabriel Gonzalez Ortega', '780-13-14', 'Madrid'),
 ('Ivan Medina Rubio', '083-08-72', 'Toledo'),
 ('Jan Vargas Santana', '780-65-24', 'Madrid'),
 ('Jesus Medina Hernandez', '782-35-25', 'Madrid'),
 ('Jose Gallardo Rodriguez', '783-65-11', 'Madrid'),
 ('Manuel Angel Gil', '733-65-16', 'Madrid'),
 ('Mario Flores Gallardo', '036-15-36', 'Madrid'),
 ('Pol Moya Pena', '780-25-24', 'Toledo'),
 ('Rayan Leon Ferrer', '430-65-24', 'Madrid'),
 ('Roberto Martin Ortega', '742-63-27', 'Madrid')]

In [9]:
%sql select count(nombre) from cliente

 * sqlite:///love4pets.db
Done.

[(15,)]

In [10]:
%sql select nombre, salario FROM empleado WHERE salario => 1500;

 * sqlite:///love4pets.db
(sqlite3.OperationalError) near ">": syntax error
[SQL: select nombre, salario FROM empleado WHERE salario => 1500;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [11]:
%sql select nombre, salario FROM empleado WHERE salario =<1500;

 * sqlite:///love4pets.db
(sqlite3.OperationalError) near "<": syntax error
[SQL: select nombre, salario FROM empleado WHERE salario =<1500;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [12]:
%sql select nombre, salario FROM empleado WHERE salario <= 1500;

 * sqlite:///love4pets.db
Done.

[('Andres Riera Herrera', 1500),
 ('Lucas Serrano Caballero', 1200),
 ('Pablo Pons Sanz', 1350),
 ('Nil Soler Diez', 1100),
 ('Sergio Reyes Gallardo', 1000),
 ('Guillermo Vidal Gomez', 1400),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500)]

In [13]:
%sql select nombre, salario FROM empleado WHERE salario >= 1500;

 * sqlite:///love4pets.db
Done.

[('Andres Riera Herrera', 1500),
 ('Saul Moreno Santos', 1600),
 ('Isaac Jimenez Ortiz', 1600),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500),
 ('Miguel Soto', 1900),
 ('Alejandro Fernandez', 1850)]

In [14]:
%sql select * from cliente

 * sqlite:///love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]


Ejercicio 2.

Con el propósito actualizar la información de los clientes se quiere contactar a aquellos clientes que no tienen asociada una persona de contacto, para esto se pide que muestre de la tabla "cliente" los campos "nombre" y "telefono" de los clientes que no tienen un contacto registrado.

In [15]:
%sql select nombre, telefono from cliente where contacto is null

 * sqlite:///love4pets.db
Done.

[]

In [16]:
%sql select nombre, telefono from cliente where contacto is none

 * sqlite:///love4pets.db
(sqlite3.OperationalError) no such column: none
[SQL: select nombre, telefono from cliente where contacto is none]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [17]:
%sql select nombre, telefono from cliente where contacto = ''

 * sqlite:///love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24')]


Ejercicio 3.

Un empleado de la empresa Love4Pets se dió cuenta que un cliente dejó por accidente su celular, el empleado recuerda que alguno de sus apellidos era "Leon".

Se quiere que determinar a quien pertenece el celular extraviado, y en caso de ser posible avisar a su persona de contacto que el celular está a salvo y pueden pasar buscandolo en cualquier momento.

Se sabe que la tabla "cliente" tiene un campo "nombre" el cual contiene nombres y apellidos, el campo "contacto" que tiene el nombre de la persona de contacto y el campo "telefono_contacto" que tiene el telefono de la persona de contacto.

In [19]:
%sql select * from cliente

 * sqlite:///love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

In [21]:
%sql select nombre, contacto, telefono_contacto from cliente where nombre like "%Leon%"

 * sqlite:///love4pets.db
Done.

[('Rayan Leon Ferrer', 'Santiago Perez Ramos', '577-21-24')]

<div style="background-color: #81F781">
 <h1> Ejercicio 4. </h1><br>
      La empresa Love4Pets considera hacer un descuento sobre los productos que cuestan entre 10 y 20 euros, y complementos vitamínicos. 
      
   Se requiere que liste las columnas "nombre", "descripcion", "precio" de productos a los que debe ser aplicado el descuento. ( asuma que los productos se encuentran en la tabla "producto" )
   
   Asuma que el producto vitaminico no lleva acentos, generalmente estos productos tienen la palabra vitamina en la **"descripcion"** pero podria ser alguna variante como vitaminico o comenzar por mayusculas, el departamento de informática recomendó usar la función Like para esta busqueda.
   
   <br><br>
 
</div>

In [32]:
%sql pragma table_info(producto)

 * sqlite:///love4pets.db
Done.

[(0, 'producto_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'descripcion', 'TEXT', 1, None, 0),
 (3, 'precio', 'INTEGER', 1, None, 0)]

In [34]:
%sql select nombre, descripcion, precio from producto

 * sqlite:///love4pets.db
Done.

[('Champu Mimadito', 'Champu neutro para mascotas', 7),
 ('Vitaminas', 'Complemento vitaminico', 5),
 ('Antipulgas', 'Liquido antipulgas', 3),
 ('Perrarina', 'Huesos', 12),
 ('Gatarina', 'Catspettito', 13),
 ('Peine N7', 'Peine para perros numero 7', 3),
 ('peluqueria', 'Corte de cabello para perros', 3),
 ('Consulta', 'Consulta veterinaria', 15)]

In [43]:
%sql select nombre, descripcion, precio from producto where precio between 10 and 20 or descripcion like "%vitam%"

 * sqlite:///love4pets.db
Done.

[('Vitaminas', 'Complemento vitaminico', 5),
 ('Perrarina', 'Huesos', 12),
 ('Gatarina', 'Catspettito', 13),
 ('Consulta', 'Consulta veterinaria', 15)]

 Ejercicio 5. ¶

La empresa Love4Pets esta considerando realizar un aumento.

Se requiere que indique cual es el menor sueldo que está pagando la empresa.

In [44]:
%sql PRAGMA table_info(empleado)

 * sqlite:///love4pets.db
Done.

[(0, 'empleado_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 0, None, 0),
 (4, 'salario', 'INTEGER', 1, None, 0),
 (5, 'fecha_ingreso', 'DATETIME', 1, 'CURRENT_DATE', 0),
 (6, 'departamento_id', 'INTEGER', 0, None, 0)]

In [46]:
%sql select MIN(salario) as 'Salario mínimo' from empleado

 * sqlite:///love4pets.db
Done.

[(1000,)]

<div style="background-color: #81F781">
 <h1> Ejercicio 6. </h1><br>
    La empresa Love4Pets continúa estudiando un ajuste en los salarios de los empleados, por lo que se quiere conocer el presupuesto total requerido para el pago de los salarios.
 <br><br>

In [47]:
%sql select SUM(salario) as 'suma de todos los sueldos' from empleado

 * sqlite:///love4pets.db
Done.

[(17500,)]

<div style="background-color: #81F781">
 <h1> Ejercicio 7. </h1><br>
   Considerando la tabla "cliente" y la tabla "mascota" las cuales tienen una relación uno a muchos, como se muestra a continuación.
   
   ![relacionclientemascota.png](attachment:relacionclientemascota.png)
    
 Indique los clientes que no tienen mascota registrada.
 <br><br>
</div>

In [54]:
%%sql 
select cliente.nombre as "cliente", mascota.nombre as "mascota" from cliente
left join 
mascota on cliente.cliente_id = mascota.cliente_id where mascota.nombre is null

 * sqlite:///love4pets.db
Done.

[('Mario Flores Gallardo', None),
 ('Jan Vargas Santana', None),
 ('Aitor Ruiz Sanchez', None),
 ('Eric Rubio Carrasco', None),
 ('Jesus Medina Hernandez', None),
 ('Pol Moya Pena', None),
 ('Manuel Angel Gil', None)]

In [52]:
%sql PRAGMA table_info(cliente)

 * sqlite:///love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

In [53]:
%sql PRAGMA table_info(mascota)

 * sqlite:///love4pets.db
Done.

[(0, 'mascota_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'cliente_id', 'INTEGER', 1, None, 0),
 (3, 'especie', 'TEXT', 1, None, 0),
 (4, 'raza', 'TEXT', 1, None, 0),
 (5, 'fecha_nacimiento', 'DATETIME', 1, 'CURRENT_DATE', 0)]